Revit.AnalysisDisplay.PointAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,System.Collections.Generic.IEnumerable{Analysis.DataTypes.PointAnalysisData},System.String,System.String,System.Type)
Create a Point Analysis Display in the current view
view:
sampleLocations:
samples:

Revit.AnalysisDisplay.PointAnalysisDisplay.InternalSetSpatialFieldValues(Analysis.DataTypes.PointAnalysisData,System.Collections.Generic.List{System.Int32}@,System.String,System.String,System.Type)
Set the spatial field values for the current spatial field primitive.  The two
input sequences should be of the same length.
pointLocations:
values:

Revit.AnalysisDisplay.PointAnalysisDisplay.ByViewAndPointAnalysisData(Revit.Elements.Views.View,Analysis.DataTypes.PointAnalysisData[],System.String,System.String,System.Type)
Show a colored Point Analysis Display in the Revit view.
view: The view into which you want to draw the analysis results.
data: A list of PointAnalysisData objects.
name: An optional analysis results name to show on the results legend.
description: An optional analysis results description to show on the results legend.
unitType: An optional Unit type to provide conversions in the analysis results.
Returns: An PointAnalysisDisplay object.